Revit 2027 API
FabricWireItem.Distance Property
 Distance to the next fabric wire item Can be 0 to be used with offset along wire.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
public:
property double Distance {
	double get ();
	void set (double value);
}
member Distance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for distance is not a number
ArgumentOutOfRangeException |  When setting this property: The given value for distance must be between 0 and 30000 feet.
See Also
Reference
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace